# 1 - Importer pandas et numpy

In [33]:
import pandas as pd
import numpy as np

# 2 - Importer dans un DF nommé prenom le fichier naissance.csv

In [34]:
prenom = pd.read_csv('naissance.csv', sep=',')

# 3 - afficher des infos sur le DataFrame

In [35]:
prenom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 670 entries, 0 to 669
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  670 non-null    int64
 1   Id          670 non-null    int64
 2   Prenom      670 non-null    object
 3   An          670 non-null    int64
 4   Sexe        670 non-null    object
 5   Etat        670 non-null    object
 6   Nombre      670 non-null    int64
dtypes: int64(4), object(3)
memory usage: 36.8+ KB

# 4 -Afficher les 10 premières lignes

In [36]:
prenom.head(10)

   Unnamed: 0     Id    Prenom    An Sexe Etat  Nombre
0       11349  11350      Emma  2004    F   AK      62
1       11350  11351   Madison  2004    F   AK      48
2       11351  11352    Hannah  2004    F   AK      46
3       11352  11353     Grace  2004    F   AK      44
4       11353  11354     Emily  2004    F   AK      41
5       11354  11355   Abigail  2004    F   AK      37
6       11355  11356    Olivia  2004    F   AK      33
7       11356  11357  Isabella  2004    F   AK      30
8       11357  11358    Alyssa  2004    F   AK      29
9       11358  11359    Sophia  2004    F   AK      28

# 5 - Supprimer les colonnes  'Unnamed: 0' et 'Id' et "an"

In [37]:
del prenom['Unnamed: 0']


del prenom['Id']

del prenom["An"]

In [38]:
prenom

      Prenom Sexe Etat  Nombre
0       Emma    F   AK      62
1    Madison    F   AK      48
2     Hannah    F   AK      46
3      Grace    F   AK      44
4      Emily    F   AK      41
..       ...  ...  ...     ...
665   Skylar    F   KS      18
666  Adeline    F   KS      17
667   Alayna    F   KS      17
668      Ana    F   KS      17
669    Angel    F   KS      17

[670 rows x 4 columns]

# 6 - Donner la répartition en qte homme - femme

In [30]:
prenom['Sexe'].value_counts()

F    572
M     98
Name: Sexe, dtype: int64

# 7 - Grouper les données par 'Prenom' et assigner à nom

In [31]:
nom = prenom.groupby("Prenom").sum()
type(nom)

pandas.core.frame.DataFrame

# 8 - Trier sur la colonne count dans l'ordre descendant

In [39]:
nom.sort_values("Nombre", ascending = 0)

           Nombre
Prenom
Tylan        1312
Anna          139
Nora          132
Kennedy       126
Caroline      124
...           ...
Brookelyn       7
Grayson         7
Cailin          7
Gemma           7
Chassidy        7

[603 rows x 1 columns]

# 9 - Quel est la médiane de la colonne count

In [24]:
nom.Nombre.median()

18.0

# 10 - Afficher un résumé avec la moyenne, le min, le max

In [25]:
nom.describe()

            Nombre
count   603.000000
mean     26.615257
std      58.111057
min       7.000000
25%      11.000000
50%      18.000000
75%      23.000000
max    1312.000000